{
    "distractor_principle": [
        "Conceptual Confusion and Insufficient Discrimination: This principle utilizes conceptual similarity to design distractors that are conceptually close to the correct answer but possess subtle differences in connotation. It aims to test the examinee's ability to differentiate between easily confused concepts. Distractors typically emphasize the shared attributes of similar concepts while overlooking their crucial differences, thereby examining whether examinees deeply understand the essential characteristics of concepts and avoid cognitive biases arising from superficial similarities. This principle draws upon Conceptual Representation Theory in cognitive psychology and Discrimination Index Theory in educational measurement.",
        "Irrelevant Information Distraction and Attention Discrimination: This principle introduces distractors containing information that is superficially related but actually irrelevant to the question stem, or seemingly reasonable inferences that are unrelated to the core of the question. It aims to test the examinee's ability to filter out irrelevant information and focus on the core of the problem. Distractor design emphasizes leveraging the human cognitive processing characteristic of being susceptible to irrelevant information, testing the examinee's ability to resist interference and screen information. This principle is based on Attention Theory in psychology and Problem-Solving Theory in educational psychology.",
        "Misleading Memory Cues and Precise Recall Examination: This principle leverages the potential for ambiguity or imprecision in examinees' memory of knowledge to design distractors that contain partially correct information but include critical factual errors, or provide memory cues that easily lead to incorrect associations. It aims to test the examinee's ability to recall precisely and discern subtle differences. The distractor design strategy is to utilize the susceptibility of human memory to suggestion and reconstruction, examining the examinee's ability to precisely extract and verify detailed information. This principle draws upon Memory Reconstruction Theory in cognitive psychology and Reliability Theory in educational measurement.",
        "Core Concept Substitution and Deep Understanding Assessment: This principle substitutes the core concepts in the question stem with concepts that are superficially similar but essentially different, or replaces them with related concepts of different hierarchical levels. It aims to test the examinee's depth of understanding of core concepts, as well as their ability to discern subtle differences and hierarchical relationships between concepts. The distractor design strategy is to create confusion by utilizing semantic associations between concepts, examining whether examinees truly grasp the connotation and denotation of concepts and avoid superficial understanding of concepts. This principle is based on Semantic Network Theory in cognitive psychology and Bloom's Taxonomy of Educational Objectives.",
        "Primary-Secondary Relationship Reversal and Logical Reasoning Discrimination: This principle reverses the logical structure of the question stem, such as primary and secondary relationships, cause-and-effect relationships, conditional relationships, or compositional relationships between events or concepts. It designs distractors that appear logically sound but actually violate the logical premise of the question, aiming to test the examinee's rigor in logical reasoning and their ability to accurately understand and judge complex logical relationships between concepts. The distractor design strategy is to create traps by utilizing the subtlety and complexity of logical relationships, examining whether examinees can conduct rigorous logical analysis and avoid one-sidedness and absolutism in thinking. This principle draws upon Formal Logic and Critical Thinking Theory.",
        "Information Overload/Oversimplification Trap and Core Information Extraction: This principle designs distractors by adding excessively detailed descriptions or providing overly broad generalizations, aiming to test the examinee's ability to extract core points from complex information and avoid being misled by redundant information or superficial generalizations. The distractor design strategy is to utilize the influence of information presentation on cognitive processing, examining whether examinees can effectively process information of varying densities and grasp the essential characteristics of things. This principle is based on Information Processing Theory and Cognitive Style Theory."
    ]
}